DataProcessors/ИмпортДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ИмпортДанных</Name>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ФайлДанных</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>ТипДанных</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВыполнятьПроверку</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыКлиентов</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Потенциальный</Name>
    </Value>
    <Value>
      <Name>Активный</Name>
    </Value>
    <Value>
      <Name>Приостановлен</Name>
    </Value>
    <Value>
      <Name>Архивный</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыПреподавателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыПреподавателей</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Работает</Name>
    </Value>
    <Value>
      <Name>Отпуск</Name>
    </Value>
    <Value>
      <Name>Больничный</Name>
    </Value>
    <Value>
      <Name>НеРаботает</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыЗанятия</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Запланировано</Name>
    </Value>
    <Value>
      <Name>Подтверждено</Name>
    </Value>
    <Value>
      <Name>Проведено</Name>
    </Value>
    <Value>
      <Name>Отменено</Name>
    </Value>
    <Value>
      <Name>Перенесено</Name>
    </Value>
    <Value>
      <Name>НеСостоялось</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/Занятие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Занятие</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДатаЗанятия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВремяОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Аудитория</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Аудитории</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Аудитории</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Направление</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ТипЗанятия</Name>
      <ValueType><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыЗанятия</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <TabularSection>
      <Name>Участники</Name>
      <Attributes>
        <Attribute>
          <Name>Клиент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Абонемент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>СтатусПосещения</Name>
          <ValueType><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Стоимость</Name>
          <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Комментарий</Name>
          <ValueType><v8:Type>xs:string</v8:Type></ValueType>
        </Attribute>
      </Attributes>
    </TabularSection>

  </ChildObjects>
</MetaDataObject>

Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Клиенты</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДатаРождения</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Телефон</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Email</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Telegram</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>TelegramID</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаРегистрации</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СтатусКлиента</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыКлиентов</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыКлиентов</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ИсточникПривлечения</Name>
      <ValueType><v8:Type>cfg:EnumRef.ИсточникиПривлечения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ИсточникиПривлечения</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ОтветственныйМенеджер</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Пользователи</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СогласиеНаУведомления</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СогласиеНаОбработкуДанных</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Catalogs/Преподаватели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Преподаватели</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Телефон</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Email</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Специализация</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачалаРаботы</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыПреподавателей</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыПреподавателей</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Ставка</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Филиал</Name>
      <ValueType><v8:Type>cfg:EnumRef.Филиалы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.Филиалы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Сотрудник</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Пользователи</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Пользователи</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Catalogs/Направления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Направления</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>ДлительностьЗанятия</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>3</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>БазоваяСтоимость</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ТипЗанятия</Name>
      <ValueType><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.ТипыЗанятий</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Филиал</Name>
      <ValueType><v8:Type>cfg:EnumRef.Филиалы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.Филиалы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Описание</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <Attribute>
      <Name>Активность</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Catalogs/Абонементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Абонементы</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>СрокДействия</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>10</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Стоимость</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>2</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Направление</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДлительностьЗанятия</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>3</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВозможностьЗаморозки</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>МаксимальныйСрокЗаморозки</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>10</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>КоличествоПереносов</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>3</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Филиал</Name>
      <ValueType><v8:Type>cfg:EnumRef.Филиалы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.Филиалы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Активность</Name>
      <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

DataProcessors/ИмпортДанных/Ext/ObjectModule.bsl
// Обработка Импорт данных (Клиенты, Преподаватели, Направления, Абонементы, Расписание, История посещений)

// Чтение из JSON/CSV/XML и загрузка справочников
Процедура ВыполнитьИмпорт(Команда)
	// Проверка обязательных полей
	Если ПустаяСтрока(ФайлДанных) Тогда
		Предупреждение("Не указан файл данных.");
		Возврат;
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ФайлДанных);
	Данные = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();

	Если ТипДанных = "Клиенты" Тогда
		ЗагрузитьКлиентов(Данные);
	ИначеЕсли ТипДанных = "Преподаватели" Тогда
		ЗагрузитьПреподавателей(Данные);
	ИначеЕсли ТипДанных = "Направления" Тогда
		ЗагрузитьНаправления(Данные);
	ИначеЕсли ТипДанных = "Абонементы" Тогда
		ЗагрузитьАбонементы(Данные);
	ИначеЕсли ТипДанных = "Расписание" Тогда
		ЗагрузитьРасписание(Данные);
	КонецЕсли;

	Предупреждение("Импорт завершён успешно.");
КонецПроцедуры

Процедура ЗагрузитьКлиентов(Данные)
	Для Каждого Элемент ИЗ Данные Цикл
		Клиент = Справочники.Клиенты.НайтиПоРеквизиту("Телефон", Элемент.Телефон);
		Если Клиент.Пустая() Тогда
			Клиент = Справочники.Клиенты.СоздатьЭлемент();
		КонецЕсли;
		Клиент.Наименование = Элемент.ФИО;
		Клиент.Телефон = Элемент.Телефон;
		Клиент.Email = Элемент.Email;
		Клиент.Telegram = Элемент.Telegram;
		Если ПустоеЗначение(Клиент.ДатаРегистрации) Тогда
			Клиент.ДатаРегистрации = ТекущаяДата();
		КонецЕсли;
		Если ПустоеЗначение(Клиент.СтатусКлиента) Тогда
			Клиент.СтатусКлиента = Перечисления.СтатусыКлиентов.Активный;
		КонецЕсли;
		Клиент.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьПреподавателей(Данные)
	Для Каждого Элемент ИЗ Данные Цикл
		Преподаватель = Справочники.Преподаватели.СоздатьЭлемент();
		Преподаватель.Наименование = Элемент.ФИО;
		Преподаватель.Телефон = Элемент.Телефон;
		Преподаватель.Email = Элемент.Email;
		Преподаватель.Специализация = Элемент.Специализация;
		Преподаватель.Статус = Перечисления.СтатусыПреподавателей.Работает;
		Преподаватель.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьНаправления(Данные)
	Для Каждого Элемент ИЗ Данные Цикл
		Направление = Справочники.Направления.СоздатьЭлемент();
		Направление.Наименование = Элемент.Наименование;
		Направление.ДлительностьЗанятия = Элемент.Длительность;
		Направление.БазоваяСтоимость = Элемент.Стоимость;
		Направление.Активность = Истина;
		Направление.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьАбонементы(Данные)
	Для Каждого Элемент ИЗ Данные Цикл
		Абонемент = Справочники.Абонементы.СоздатьЭлемент();
		Абонемент.Наименование = Элемент.Наименование;
		Абонемент.КоличествоЗанятий = Элемент.КоличествоЗанятий;
		Абонемент.СрокДействия = Элемент.СрокДействия;
		Абонемент.Стоимость = Элемент.Стоимость;
		Абонемент.Активность = Истина;
		Абонемент.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьРасписание(Данные)
	Для Каждого Элемент ИЗ Данные Цикл
		Занятие = Документы.Занятие.СоздатьДокумент();
		Занятие.Дата = Элемент.Дата;
		Занятие.ДатаЗанятия = Элемент.Дата;
		Занятие.Преподаватель = Элемент.Преподаватель;
		Занятие.Аудитория = Элемент.Аудитория;
		Занятие.Направление = Элемент.Направление;
		Занятие.Статус = Перечисления.СтатусыЗанятия.Запланировано;
		Занятие.Записать();
	КонецЦикла;
КонецПроцедуры
